results/python-falcon.out
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        gunicorn/19.6.0
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /FOO
Document Length:        51 bytes

Concurrency Level:      100
Time taken for tests:   2.837 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2180000 bytes
HTML transferred:       510000 bytes
Requests per second:    3525.25 [#/sec] (mean)
Time per request:       28.367 [ms] (mean)
Time per request:       0.284 [ms] (mean, across all concurrent requests)
Transfer rate:          750.49 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   1.1      0      13
Processing:     2   28   1.9     28      35
Waiting:        1   28   1.9     28      35
Total:         15   28   1.3     28      37

Percentage of the requests served within a certain time (ms)
  50%     28
  66%     28
  75%     28
  80%     29
  90%     29
  95%     30
  98%     31
  99%     33
 100%     37 (longest request)