results/python-tornado.out
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient)


Server Software:        TornadoServer/4.5.2
Server Hostname:        127.0.0.1
Server Port:            8000

Document Path:          /FOO
Document Length:        56 bytes

Concurrency Level:      100
Time taken for tests:   9.403 seconds
Complete requests:      10000
Failed requests:        0
Total transferred:      2580000 bytes
HTML transferred:       560000 bytes
Requests per second:    1063.47 [#/sec] (mean)
Time per request:       94.032 [ms] (mean)
Time per request:       0.940 [ms] (mean, across all concurrent requests)
Transfer rate:          267.95 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       3
Processing:     1   93  13.1     93     224
Waiting:        1   93  13.1     93     224
Total:          4   93  13.0     93     228

Percentage of the requests served within a certain time (ms)
  50%     93
  66%     95
  75%     97
  80%     98
  90%    105
  95%    112
  98%    124
  99%    136
 100%    228 (longest request)